import React from 'react';
import axios from 'axios';
import {Link} from "react-router-dom";
import {withRouter} from "react-router";
import TopNav from './TopNav.jsx'

export default class Login extends React.Component {
    constructor(props) {
        super(props);
    }

    render() {
        return (
            <div>
                <TopNav user={false}/>
                <div className='LoginContainer'>
                    <div className='LoginCon'>
                        <LoginHead/>
                        <LoginForm/>
                        <LoginRegCon/>
                        <LoginForCon/>
                    </div>
                </div>
            </div>

        )
    }
}

function LoginHead() {
    return (
        <div className='LoginHead'>
            <svg id="title" width="262px" height="49px" viewBox="0 0 262 49" version="1.1">
                <g id="名称">
                    <g id="Student" fill="#33548A">
                        <path
                            d="M74.2041 35.2361L70.8545 35.2361L70.8545 32.0916L70.7861 32.0916Q68.7183 35.6804 64.3604 35.6804Q60.7715 35.6804 58.6523 33.1255Q56.5332 30.5706 56.5332 26.2297Q56.5332 21.5471 58.9258 18.7188Q61.3184 15.8904 65.1807 15.8904Q69.043 15.8904 70.7861 18.8982L70.8545 18.8982L70.8545 7.26001L74.2041 7.26001L74.2041 35.2361ZM2.1875 30.2629Q3.40088 31.3225 5.43457 32.0061Q7.46826 32.6897 9.29688 32.6897Q14.8682 32.6897 14.8682 28.7249Q14.8682 27.614 14.27 26.7253Q13.6719 25.8367 12.6294 25.1531Q11.5869 24.4695 8.71582 23.051Q4.73389 21.0686 3.46924 19.3682Q2.20459 17.6677 2.20459 15.4802Q2.20459 12.1819 4.85352 10.2507Q7.50244 8.31958 11.5356 8.31958Q15.4834 8.31958 17.3291 9.27661L17.3291 13.0022Q14.9365 11.3445 11.2793 11.3445Q8.85254 11.3445 7.323 12.3613Q5.79346 13.3782 5.79346 15.1897Q5.79346 16.7961 6.85303 17.8044Q7.9126 18.8127 11.4502 20.5559Q15.3467 22.4187 16.9019 24.2815Q18.457 26.1443 18.457 28.4685Q18.457 31.9548 15.9277 33.8176Q13.3984 35.6804 8.90381 35.6804Q7.33154 35.6804 5.23804 35.2446Q3.14453 34.8088 2.1875 34.1594L2.1875 30.2629ZM32.2656 35.0481Q31.1719 35.6462 29.3091 35.6462Q24.2334 35.6462 24.2334 30.0237L24.2334 19.1033L20.9863 19.1033L20.9863 16.3347L24.2334 16.3347L24.2334 11.7888L27.5659 10.7292L27.5659 16.3347L32.2656 16.3347L32.2656 19.1033L27.5659 19.1033L27.5659 29.4255Q27.5659 31.2883 28.1982 32.0916Q28.8306 32.8948 30.3003 32.8948Q31.4282 32.8948 32.2656 32.2625L32.2656 35.0481ZM127.729 35.6462Q129.592 35.6462 130.686 35.0481L130.686 32.2625Q129.849 32.8948 128.721 32.8948Q127.251 32.8948 126.619 32.0916Q125.986 31.2883 125.986 29.4255L125.986 19.1033L130.686 19.1033L130.686 16.3347L125.986 16.3347L125.986 10.7292L122.654 11.7888L122.654 16.3347L119.407 16.3347L119.407 19.1033L122.654 19.1033L122.654 30.0237Q122.654 35.6462 127.729 35.6462ZM82.356 26.6399L95.5835 26.6399L95.5835 24.948Q95.5835 20.6584 93.4985 18.2744Q91.4136 15.8904 87.7051 15.8904Q83.9624 15.8904 81.4417 18.7102Q78.9209 21.53 78.9209 25.8708Q78.9209 30.4851 81.2195 33.0828Q83.5181 35.6804 87.6196 35.6804Q91.7383 35.6804 94.2334 33.9202L94.2334 30.9294Q91.5845 32.9631 88.4058 32.9631Q85.5859 32.9631 84.0137 31.314Q82.4414 29.6648 82.356 26.6399ZM116.023 35.2361L112.69 35.2361L112.69 24.4866Q112.69 18.6589 108.435 18.6589Q106.23 18.6589 104.812 20.2996Q103.394 21.9402 103.394 24.4524L103.394 35.2361L100.044 35.2361L100.044 16.3347L103.394 16.3347L103.394 19.4622L103.462 19.4622Q105.598 15.8904 109.666 15.8904Q112.776 15.8904 114.399 17.8813Q116.023 19.8723 116.023 23.6833L116.023 35.2361ZM48.4668 35.2361L51.8335 35.2361L51.8335 16.3347L48.4668 16.3347L48.4668 27.2209Q48.4668 29.6819 47.1167 31.2969Q45.7666 32.9119 43.5791 32.9119Q39.1699 32.9119 39.1699 27.1526L39.1699 16.3347L35.8545 16.3347L35.8545 27.6482Q35.8545 35.6804 42.5708 35.6804Q46.5015 35.6804 48.3984 32.2625L48.4668 32.2625L48.4668 35.2361ZM91.0205 19.9919Q92.2168 21.3933 92.2339 23.9568L82.356 23.9568Q82.7319 21.5642 84.1931 20.0774Q85.6543 18.5906 87.6538 18.5906Q89.8242 18.5906 91.0205 19.9919ZM70.8716 23.991Q70.8716 21.718 69.3762 20.1885Q67.8809 18.6589 65.6934 18.6589Q63.0273 18.6589 61.4893 20.6499Q59.9512 22.6409 59.9512 26.0759Q59.9512 29.2375 61.4294 31.0747Q62.9077 32.9119 65.3687 32.9119Q67.7954 32.9119 69.3335 31.1089Q70.8716 29.3059 70.8716 26.6228L70.8716 23.991Z"/>
                    </g>
                    <g id="Club" fill="#E67F4F">
                        <path
                            d="M158.047 7.26001L158.047 35.2361L161.396 35.2361L161.396 7.26001L158.047 7.26001ZM192.295 35.2361L192.295 32.5701L192.363 32.5701Q194.294 35.6804 197.986 35.6804Q201.899 35.6804 204.249 32.8521Q206.599 30.0237 206.599 25.2385Q206.599 20.8977 204.506 18.394Q202.412 15.8904 198.857 15.8904Q194.585 15.8904 192.363 19.5989L192.295 19.5989L192.295 7.26001L188.945 7.26001L188.945 35.2361L192.295 35.2361ZM145.862 35.6804Q150.271 35.6804 153.193 34.1423L153.193 30.8611Q150.288 32.6384 146.357 32.6384Q142.153 32.6384 139.556 29.8442Q136.958 27.05 136.958 22.2991Q136.958 17.2917 139.744 14.3438Q142.529 11.3958 146.956 11.3958Q150.356 11.3958 153.193 12.968L153.193 9.39624Q150.715 8.31958 146.921 8.31958Q141.025 8.31958 137.197 12.2161Q133.369 16.1126 133.369 22.5042Q133.369 28.4514 136.77 32.0659Q140.171 35.6804 145.862 35.6804ZM182.981 35.2361L179.614 35.2361L179.614 32.2625L179.546 32.2625Q177.649 35.6804 173.718 35.6804Q167.002 35.6804 167.002 27.6482L167.002 16.3347L170.317 16.3347L170.317 27.1526Q170.317 32.9119 174.727 32.9119Q176.914 32.9119 178.264 31.2969Q179.614 29.6819 179.614 27.2209L179.614 16.3347L182.981 16.3347L182.981 35.2361ZM193.765 31.3311Q192.278 29.7502 192.278 27.4602L192.278 24.8967Q192.278 22.1794 193.876 20.4192Q195.474 18.6589 197.935 18.6589Q200.361 18.6589 201.763 20.4277Q203.164 22.1965 203.164 25.1873Q203.164 28.8103 201.66 30.8611Q200.156 32.9119 197.49 32.9119Q195.251 32.9119 193.765 31.3311Z"/>
                    </g>
                </g>
            </svg>
        </div>
    )

}

class LoginForm extends React.Component {
    constructor(props) {
        super(props);
        this.state = {
            name: '',
            psd: '',
            // success: true,
        }
    }

    componentDidMount() {
        // console.log(this.props);
    }

    handleSubmit = (e) => {
        let data = {"name": this.state.name, "psd": this.state.psd};
        e.preventDefault();
        axios.post('http://127.0.0.1:8000/signin/', data).then((res) => {
            this.LoginOrNot(res.data['success'])
        }).catch((e) => console.error(e));
    };
    LoginOrNot = (success) => {
        if (success === 1) {
            console.log("success log in ");
            this.props.history.push('/huche');
        } else if (success === 0) {
            alert("用户名或密码错误，请重新输入");
            // this.setState({'psd': null});
        } else {
            console.error("error");
        }
    };
    handleChange = (e) => {
        this.setState({
            [e.target.name]: e.target.value
        });
    };

    render() {
        return (
            <form className='LoginForm' onSubmit={this.handleSubmit}>
                <div className='LoginNPCon'>
                    <div className="LoginUser LoginInputCon">
                        <input type="text" className='LoginInputUser LoginInput' name="name" placeholder="用户名"
                               required="required" onChange={this.handleChange}
                               autoComplete='off'/>
                    </div>
                    <div className="LoginPsd LoginInputCon">
                        <input type='password' className='LoginInputPsd LoginInput' name='psd' placeholder="密码"
                               required="required"
                               autoComplete='off' onChange={this.handleChange}/>
                    </div>
                </div>
                <div className="LoginBtnCon">
                    <input type="submit" className="LoginBtn" name='submit' value="登陆"/>
                </div>
                <div className='LoginOptCon'>
                    <input type="checkbox" name="radioName1" id="redio1"/>
                    <label id="radioName1" htmlFor="redio1">记住密码</label>
                    <input type="checkbox" name="radioName2" id="redio2"/>
                    <label id="radioName2" htmlFor="redio2">自动登陆</label>
                </div>
            </form>
        );
    }
}

LoginForm = withRouter(LoginForm);

class LoginRegCon extends React.Component {
    constructor(props) {
        super(props);
    }

    render() {
        return (
            <div className='LoginRegCon'>
                <Link to={'/reg'} className="LoginReg">新用户注册</Link>
            </div>
        );
    }
}

class LoginForCon extends React.Component {
    constructor(props) {
        super(props);
    }

    render() {
        return (
            <div className='LoginForCon'>
                <Link to={'/huche'} className="LoginFor">忘记密码</Link>
            </div>
        );
    }

}
